{"status": "done", "title": "Busan Bites: Diving Deep into Busan Seafood", "transcript": "```\nHae-won:\nAnnyeonghaseyo, food lovers, and welcome back to Busan Bites! It's your host, Hae-won, ready to dive deep into the delicious world of Busan's seafood. Today, we're not just skimming the surface; we're going full submersible to explore some of the fascinating fish species that call our waters home.\n\nBefore we start, for those of you who are new to the show, when I say 'Jagalchi Market,' I mean 자갈치시장(Jagalchi Sijang), Busan's biggest seafood market located near the port. It's a must-visit for any seafood enthusiast! You can find just about anything there.\n\nAlright, let's get started, shall we? First up, we have *galchi* (갈치), or Silver Hairtail in English [pronunciation: gal-chi]. These guys are long, slender, and shimmering silver – hence the name! You'll usually find them in the warmer waters south of Busan. Now, *galchi* is incredibly versatile. We grill it, we braise it, but my absolute favorite is *galchi jorim* (갈치조림) – braised hairtail with radish and spicy sauce. Oh, it's heavenly! My halmeoni – that’s grandma in Korean – used to make the best *galchi jorim*. One time, I tried to recreate her recipe, and I accidentally added way too much gochugaru, Korean chili powder. Let's just say it was so spicy, I thought my taste buds were going to stage a rebellion! But hey, even mistakes can be delicious learning experiences.\n\nNext on our fishy adventure is *domi* (도미), or Red Sea Bream [pronunciation: do-mi]. *Domi* are beautiful pinkish-red fish, and you can find them all around the Busan coast. It is often served at celebratory events and is a popular fish to eat in Korea. Now, *domi* is fantastic as *hoe* (회) – that's sashimi in Korean [pronunciation: hweh]. The texture is just amazing! I remember one time I went fishing with my father and we caught a particularly big *domi*. My father filleted it perfectly and we ate it right there at the sea! You can't get any fresher than that!\n\nOkay, let's talk about *jangeo* (장어), or eel [pronunciation: jang-uh]. Now, there are a couple of kinds we commonly eat here, including *bomm jangeo*(붕장어) which is called Conger Eel, and *minmul jangeo*(민물장어) which is freshwater eel. They're long, slithery (obviously!), and super popular grilled with a sweet and savory sauce. You’ll find them both around Busan, though the Conger Eel is from the sea and freshwater eel is raised in farms. It's a classic Busan dish. People believe it gives you energy, especially in the summer. And I have to tell you a funny story: I once tried to cook eel at home for my friends, and it kept wiggling off the cutting board! It was like a scene from a cartoon. We ended up laughing so hard, we almost forgot about dinner.\n\nLast but not least, we have *myeolchi* (멸치), or anchovies [pronunciation: myuhl-chi]. Now, I know what you're thinking – anchovies? But trust me, in Busan, *myeolchi* is a star! These tiny fish are everywhere, and we use them in everything from broth to side dishes. And Busan is very famous for its *myeolchi hoe* (멸치회) – fresh anchovy sashimi. They are smaller and more delicate than European anchovies. One of my favorite ways to enjoy *myeolchi* is *myeolchi bokkeum* (멸치볶음), which is stir-fried anchovies with soy sauce and chili. It's the perfect banchan, a side dish, to have with rice.\n\nAnd that's a wrap for today's episode of Busan Bites! I hope you enjoyed our little underwater culinary adventure. Remember to come visit Busan and try these delicious fish for yourselves! Until next time, eat well and stay curious! Annyeong!\n```", "speakers": 1, "voices": ["F"], "use_internet": true, "saved": true, "category": "generated", "saved_at": "2025-09-30T05:30:44.943240Z", "job_id": "0cbea29b-3ab7-4bed-ad70-cd4baff521d1"}