{"status": "done", "title": "Riyad Mahrez Algerian Football Legend From Sarcelles to Glory", "transcript": "Okay, here's a monologue in Algerian Arabic, fitting the description you provided:\n\n(Begins with an enthusiastic tone)\n\nKhoya, ch'hal rah joz waqt! Today, we're diving deep into the career of one of Algeria's greatest footballing exports: Riyad Mahrez!. Riyad, el-Khedra's magician, the guy who made us dream, and continues to do so even now. Let's be real, who hasn't tried to imitate that left foot?.\n\n(Shifts to a more analytical tone)\n\nLet's rewind a bit. Remember his early days? Sarcelles in France, then Quimper, Le Havre... a slow and steady climb. No one could have predicted what was coming. Then Leicester City came knocking in 2014. Honestly, at the time, we thought, \"Okay, another Algerian player trying his luck in Europe.\" But this was different. This was special.\n\n(Voice rises with excitement)\n\nThat 2015-2016 season... Ya Khouti! Leicester City winning the Premier League? A miracle! And Mahrez was at the heart of it all!. His goals, his assists, that magic in his feet… He was named PFA Players' Player of the Year!. The first African to win it!. A true legend. He made us proud, raised our flag high.\n\n(Calmer, more reflective)\n\nThen came the move to Manchester City in 2018. Some were worried. Would he get enough playing time? Would he shine in a team full of superstars? But Mahrez proved everyone wrong. He collected trophies: Premier League titles, FA Cups, Carabao Cups, and finally, the Champions League in 2023. He became a serial winner!\n\n(Back to excitement)\n\nAnd let’s not forget his contribution to the Algerian national team. Ah, the 2019 AFCON!. Leading the team as captain, scoring that unforgettable free-kick against Nigeria in the semi-final. That moment...pure joy! Winning the cup, our first since 1990! Mahrez cemented his place as a national hero.\n\n(Addresses recent news)\n\nNow, of course, he's playing in Saudi Arabia for Al-Ahli. Some say it's a step down. Maybe. But he's still showcasing his talent, earning a good living, and who knows, maybe inspiring a new generation of Arab footballers.\n\n(Concluding remarks, a mix of admiration and respect)\n\nRiyad Mahrez... a player with incredible dribbling skills, a deadly left foot, and a knack for scoring important goals. He's a role model, an inspiration, and a true Algerian icon. Whether you’re a Cityzen, a Fox or a Fenek, you have to admire his journey. May Allah protect him and give him continued success.\n", "speakers": 1, "voices": ["M"], "use_internet": true, "job_id": "6b1dca08-d2bb-4d5e-ac89-9e9b424da77e"}