{"status": "done", "title": "Busan Sports: City Vibe, Athletic Pride", "transcript": "Host: 자, 여러분 안녕하세요! 부산 스포츠에 대한 팟캐스트에 오신 것을 환영합니다! Today, we're diving deep into how Busan's unique vibe influences the athletic scene here. 진짜 재밌을 거예요!\n\n부산... 아, Busan! It's not just about 해운대 beach, you know? This city breathes sports! Think about it – we're surrounded by mountains on one side and the ocean on the other. So naturally, hiking and 물놀이 – water sports – are huge here. But it goes way beyond that. The environment shapes our sporting culture in ways you might not even realize.\n\nTake our baseball team, the Lotte Giants. They’re like, the heart and soul of Busan, right? Their games at 사직구장 – Sajik Baseball Stadium – are legendary. The fans are so passionate, so loud! It's like a party every single game. And that passion, I think it comes from 부산 사람들의 그… 끈기? Resilience, yeah! We’re a hard-working city, and we bring that energy to supporting our team.\n\nAnd speaking of energy, you know what I mean, you gotta have stamina to play any sport, right? That reminds me! Have you ever had Dwaeji Gukbap? 돼지국밥! That rich, hearty pork rice soup? It’s like, the ultimate Busan comfort food. I always say it’s the perfect fuel for athletes! I mean, metaphorically speaking. It's like that hearty broth gives you the strength and that rich flavor represents the spirit of Busan’s sports culture! It’s kinda like the team spirit, you know? Warm, filling, and keeps you going strong even when things get tough.\n\nAlso, you can't forget the Busan Asiad Main Stadium! 부산아시아드주경기장. It’s a landmark, a symbol of 부산’s commitment to sports. It’s hosted so many international events, and it’s a reminder of Busan's ability to host large games with a lot of people. It is such a huge stadium! When you are there, you really feel Busan's pride in sports!\n\nPlus, the ocean! We have sailing, windsurfing, all kinds of water sports. The geography really lends itself to these activities, and you see more and more young people getting involved, which is awesome. And it's not just about the pros. You go down to 광안리 beach on the weekend, and everyone's out there playing volleyball, frisbee… just having fun. It’s all part of the 부산 culture.\n\n부산 is a city that lives and breathes sports! Whether it's cheering on the Giants, enjoying water sports, or just grabbing a bowl of 돼지국밥 after a good game, sports are woven into the fabric of our city. I'm really excited to see what the future holds for sports in Busan! 아, 진짜 기대된다! Okay, up next, we’ll be talking to…\n", "speakers": 1, "voices": ["M"], "use_internet": true, "saved": true, "category": "localisation", "saved_at": "2025-09-30T06:42:34.960257Z", "theme": "sport", "geo_location": "Busan", "voice_names": ["Charon"], "job_id": "9b32d4f6-1a3d-4733-898c-f1b17bf18419"}